[
    {
        "id":1,
        "title":"Self-Directed Front-End Developer Journey",
        "companyName": "Home-Based",
        "date":"August 2025 - Ongoing",
        "location": "Islamabad, Pakistan",
        "details":[
            "Over the course of this self-directed learning journey, I have acquired foundational proficiency in HTML, CSS, TailwindCSS, JavaScript, and React.js.",

            "I excel in crafting responsive and component based engaging web experiences using TailwindCSS, seamlessly weaving pre-built dynamic components into bespoke layouts while adeptly integrating externally authored constructs into established project architectures.",

            "I am well-versed in leveraging React hooks—useState, useRef, useEffect, and useContext—to efficiently manage component life-cycle, state, and shared context.",

            "I am experienced with React Router for seamless navigation, react-hook-form for streamlined data input, and schema-based validation using Zod and Yup.",

            "I have hands-on familiarity with asynchronous patterns including callbacks and Promises for API interactions, alongside TanStack Query for robust, declarative data fetching, caching, and background synchronization.",

            "I possess a solid conceptual understanding of RESTful APIs, the Virtual DOM, and SPA architecture."
        ],
        "tools":[
            "HTML",
            "CSS",
            "JavaScript",
            "React",
            "TailwindCSS",
            "React Hooks",
            "React Router",
            "react-hook-form",
            "Zod",
            "Yup",
            "TanStack Query",
            "Fetch API",
            "Promises",
            "Virtual DOM",
            "SPA Architecture",
            "RestfulAPIs"
        ]
    },
    {
        "id":2,
        "title":"Technical Support Engineer",
        "companyName": "Fexen Smart Solutions",
        "date":"December 2014 - September 2025",
        "location": "Islamabad, Pakistan",
        "details":[
            "Delivered specialized technical support for blockchain-powered platforms and cryptocurrency exchange interfaces developed by Fexen, ensuring seamless user functionality and issue resolution.",

            "Designed and maintained user-centric support infrastructure, including dynamic 'How It Works' interactive guides in Figma and detailed FAQ sections to empower users and elevate on boarding experiences.",

            "Concurrently initiated self-directed exploration into front-end development during tenure, acquiring foundational skills in HTML, CSS, JavaScript, and React.js to enhance technical proficiency and contribute to team projects."
        ],
        "tools":[
            "Zendesk",
            "Jira",
            "Blockchain",
            "MS Office",
            "Figma",
            "HTML",
            "CSS",
            "JavaScript",
            "React"
            
        ]
    }
]