[
    {
        "id": 1,
        "title": "Front-End Developer (Web)",
        "companyName": "Fexen Smart Solutions",
        "date": "December 2024 – September 2025",
        "location": "Islamabad, Pakistan",
        "details": [
            "Worked with React.js and TailwindCSS on live web projects, contributing to various features and improvements.",
            "Helped build responsive web interfaces using TailwindCSS, collaborating with the team to integrate reusable components, third-party libraries and custom layouts while ensuring consistent design across devices.",
            "Used React hooks (useState, useRef, useEffect, useContext), Redux and tanStack Query for state and life-cycle management, contributed to client-side routing with React Router, form handling with react-hook-form + validation (Zod, Yup).",
            "Assisted with API integration (RESTful endpoints, async/await, Promises), Context API for shared state and followed standard SPA best practices.",
            "Supported deployment workflows: helped set up mock APIs on Cloudflare Workers with KV storage, used GitHub for version control and deployed web builds on Vercel as part of the team."
        ],
        "tools": [
            "React",
            "TailwindCSS",
            "React Hooks",
            "React Router",
            "react-hook-form",
            "ContextAPI",
            "tanStack Query",
            "Redux",
            "Zod",
            "Yup",
            "TanStack Query",
            "Fetch API",
            "Promises",
            "Virtual DOM",
            "SPA Architecture",
            "RestfulAPIs",
            "Cloudflare Workers",
            "GitHub",
            "Vercel"
        ]
    },
    {
        "id": 2,
        "title": "Front End Dev Intern (Web & Mobile)",
        "companyName": "Aivatek",
        "date": "August 2024 – October 2024",
        "location": "Islamabad, Pakistan",
        "details": [
            "Learned to convert design mockups into clean, responsive web pages using HTML5, CSS3, and modern JavaScript (ES6+), quickly grasping how to make them look and perform consistently across mobile, tablet and desktop devices.",
            "Gained hands-on experience building reusable React.js components and managing state with hooks, while getting comfortable with team practices like mobile-first design, collaborative Git workflows and practical debugging techniques.",
            "Received initial exposure to React Native development, learning core concepts, component structure and cross-platform basics while contributing to mock mobile project tasks under team guidance."
        ],
        "tools": [
            "HTML",
            "CSS",
            "JavaScript",
            "React",
            "React-Native",
            "NativeWind",
            "GitHub",
            "Vercel"
        ]
    }
]